УТ_для_edt/src/Catalogs/CRM_Решения/CRM_Решения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_Решения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <comment>Автор решения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВложений</name>
    <comment>Источник вложений</comment>
    <type>
      <types>CatalogRef.CRM_Решения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКатегория</name>
    <comment>Основная категория</comment>
    <type>
      <types>CatalogRef.CRM_КатегорииРешений</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <comment>Проект/процесс</comment>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРешения</name>
    <comment>Статус решения</comment>
    <type>
      <types>EnumRef.CRM_СтатусыРешений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВопроса</name>
    <comment>Текст вопроса</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВопросаHTML</name>
    <comment>Текст вопроса в формате HTML</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНаименованияРешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Категории</name>
    <comment>Категории</comment>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.CRM_КатегорииРешений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответы</name>
    <comment>Ответы</comment>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АвторИзменения</name>
      <comment>Автор изменения</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтвета</name>
      <comment>Вариант ответа</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтветаHTML</name>
      <comment>Вариант ответа в формате HTML</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеОтвета</name>
      <comment>Наименование ответа</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОтвета</name>
      <comment>Статус ответа</comment>
      <type>
        <types>EnumRef.CRM_СтатусыРешений</types>
      </type>
    </attributes>
    <attributes>
      <name>удалитьCRM_НомерСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Enums/CRM_СтатусыРешений/CRM_СтатусыРешений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СтатусыРешений</name>
  <enumValues>
    <name>Личное</name>
    <comment>Личное</comment>
  </enumValues>
  <enumValues>
    <name>НаРассмотрении</name>
    <comment>На рассмотрении</comment>
  </enumValues>
  <enumValues>
    <name>Утверждено</name>
    <comment>Утверждено</comment>
  </enumValues>
  <enumValues>
    <name>Устарело</name>
    <comment>Устарело</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_Решения/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Устанавливаем отбор по текущему пользователю и статусам решений.
	СписокСостояний = Новый СписокЗначений;
	СписокСостояний.Добавить(Перечисления.CRM_СтатусыРешений.Утверждено);
	СписокСостояний.Добавить(Перечисления.CRM_СтатусыРешений.Устарело);
	Если CRM_БазаЗнанийСервер.ЕстьПраваАдминистратора() Тогда
		СписокСостояний.Добавить(Перечисления.CRM_СтатусыРешений.НаРассмотрении);
	КонецЕсли;	
	Для Каждого ЭлементОтбораГруппы Из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если НЕ (ЭлементОтбораГруппы.Представление = "ОтборРешений") Тогда Продолжить; КонецЕсли;
		Для Каждого ЭлементОтбора Из ЭлементОтбораГруппы.Элементы Цикл
			Если ЭлементОтбора.Представление = "ОтборПоАвтору" Тогда
				ЭлементОтбора.ПравоеЗначение = Пользователи.АвторизованныйПользователь();
			ИначеЕсли ЭлементОтбора.Представление = "ОтборПоСтатусу" Тогда
				ЭлементОтбора.ПравоеЗначение = СписокСостояний;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;	
	
	РежимВыбора = Параметры.РежимВыбора;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Процедура - обработчик события формы "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если (ИмяСобытия = "CRM_РешенияОбновлениеСправочника") И (Параметр = ТекущийВопрос) Тогда
		СодержимоеРезультата = CRM_БазаЗнанийСервер.ЗаполнитьПредставлениеРешенияДляСписка(Параметр, УникальныйИдентификатор);
	КонецЕсли;	
КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "Выбор" табличной части "Список".
//
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если РежимВыбора Тогда
		СтандартнаяОбработка = Ложь;
		Закрыть(ВыбраннаяСтрока);
	КонецЕсли;	
КонецПроцедуры // СписокВыбор()

&НаКлиенте
// Процедура - обработчик события "ПриАктивизацииСтроки" табличной части "Список".
//
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбработчикСписокПриАктивизацииСтроки", 0.5, Истина);
КонецПроцедуры // СписокПриАктивизацииСтроки()

// Процедура - обработчик события "ПриНажатии" поля описания решения.
//
&НаКлиенте
Процедура ТекстВопросаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	CRM_ОбщегоНазначенияКлиент.ОткрытьСсылку(ДанныеСобытия.Href, ДанныеСобытия.Element,, Элемент.Документ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПустоеОписание()
	Возврат
	"<html>
	|<head>  
	|<META http-equiv=Content-Type content=""text/html; charset=utf-8"">
	|<META content=""MSHTML 6.00.2800.1400"" name=GENERATOR>
	|<body scroll=""auto"">
	|</body>
	|</html>";
КонецФункции

&НаКлиенте
// Процедура - обработчик события "ПриАктивизацииСтроки" табличной части "Список".
//
// Параметры:
//	Нет.
//
Процедура ОбработчикСписокПриАктивизацииСтроки()
	
	Если ТекущийВопрос = Элементы.Список.ТекущаяСтрока Тогда Возврат; КонецЕсли;
	
	ТекущийВопрос = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущийВопрос = Неопределено Тогда 
		СодержимоеРезультата = СформироватьПустоеОписание();
	Иначе
		СодержимоеРезультата = CRM_БазаЗнанийСервер.ЗаполнитьПредставлениеРешенияДляСписка(ТекущийВопрос, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры // ОбработчикСписокПриАктивизацииСтроки()

#КонецОбласти
